# 4.5 Data Consistency Checks
### This script contains the following points:
#### 01 Import of libraries and data
#### 02 Consistency checks on df_prods and df_ords
#### 03 Descriptive Statistics
#### 04 Checking for mixed data types
#### 05 Checking for missing values
#### 06 Address missing values
#### 07 Checking for duplicates
#### 08 Export of Data

# 01 Import of libraries and data

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
#create data path
path = r'C:\Users\fa_an\OneDrive\CareerFoundry\Tasks\Data Analytics Immersion\Tasks 4.1-4.10\02_2024 Instacart Basket Analysis'

In [3]:
path

'C:\\Users\\fa_an\\OneDrive\\CareerFoundry\\Tasks\\Data Analytics Immersion\\Tasks 4.1-4.10\\02_2024 Instacart Basket Analysis'

In [4]:
#import products.csv df
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [5]:
#import orders_wrangled.csv df from prepared data
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 02 Consistency Checks

In [6]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [7]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

In [8]:
#check descriptive statistics for df_ords
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [9]:
#create a dataframe
df_test = pd.DataFrame()

In [10]:
#create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [11]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [12]:
#check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [13]:
#update mix col to new datatype - str
df_test['mix'] = df_test['mix'].astype('str')

In [14]:
df_test['mix'].dtype

dtype('O')

In [15]:
#finding missing values in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [16]:
#view missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [17]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [18]:
df_prods.shape

(49693, 5)

In [19]:
#create new subset df
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [20]:
df_prods_clean.shape

(49677, 5)

In [21]:
#finding duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [22]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [23]:
df_prods_clean.shape

(49677, 5)

In [24]:
#create new df for dropped duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [25]:
df_prods_clean_no_dups.shape

(49672, 5)

# 03 Descriptive Statistics

In [27]:
#check descriptive statistics for df_ords
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [28]:
#Besides the unnamed column, which is the row id number. As earlier reviewed in the lesson, orders_day_of_week,
#order_hour_of_day, and days_since_prior order look good. The min, max, and percentiles look good. Nothing negative
#or out of the ordinary based on the parameters for those columns.

# 04 Checking for mixed data types

In [29]:
#check for mixed data type in df_ords
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)
else:
    print('Everything is a-ok!')

Everything is a-ok!

In [30]:
#No mixed data type columns found in df_ords, single data type columns only!

# 05 Checking for missing values

In [31]:
#check for missing values in df_ords
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [32]:
#Missing values from days_since_prior_order is 206,209 rows. Woah!

# 06 Address missing values

In [33]:
#Address the missing values using an appropriate method and explain why you used your method of choice.

In [34]:
#create flag for missing values denoting it's a first order vs a repeat order
df_ords['first_or_repeat_order'] = np.where(df_ords['days_since_prior_order'].isnull(),'First Order', 'Repeat Order')

In [35]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_or_repeat_order
0,0,2539329,1,prior,1,2,8,NaN,First Order
1,1,2398795,1,prior,2,3,7,15.0,Repeat Order
2,2,473747,1,prior,3,3,12,21.0,Repeat Order
3,3,2254736,1,prior,4,4,7,29.0,Repeat Order
4,4,431534,1,prior,5,4,15,28.0,Repeat Order

In [36]:
#change data type of first_or_repeat_order column
df_ords['first_or_repeat_order'] = df_ords['first_or_repeat_order'].astype('category')

In [37]:
df_ords['first_or_repeat_order'].dtype

CategoricalDtype(categories=['First Order', 'Repeat Order'], ordered=False, categories_dtype=object)

In [38]:
#I chose to create a new column and flag the missing orders based on a first or repeat order. That way it explains the reason
#for not having any days_since_prior_order if it's the customer's first order. Hooray! No need to impute, remove, or filter
#out the missing data. The data is still needed for doing the overall analysis.

# 07 Check for duplicate values

In [39]:
#Run a check for duplicate values in your df_ords data.Report your findings and propose an explanation for any duplicate
#values you find.

In [40]:
df_dups = df_ords[df_ords.duplicated()]

In [41]:
df_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_or_repeat_order]
Index: []

In [42]:
#There are no duplicates in df_ords.

In [43]:
#Since no dups were found, no further action is needed.

# 08 Export of data

In [44]:
#Export your final, Export your final, cleaned df_prods data as “.csv” file in your “Prepared Data” folder
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [45]:
#Export your final, df_ords data as “.csv” file in your “Prepared Data” folder
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))